information-technology/programming/programming-languages/python/python-reference.org
* import
#+BEGIN_SRC python
import ...
import ... as ...
from ... import ...
from ... import *
#+END_SRC
* list
[]

* string
"a"
'a'

* tuple
'a','b'
('a','b')

* mapping unpacking
the mapping unpacking operator is ** and it can be applied to a mapping to produce a key-value list.
**locals()


* sequence unpacking
Any iterable can unpacked using the sequence unpacking operator (*)

first, *rest = [1,2,3,4,5]

def prouct(a, b, c):
    return a * b * c

l = [1,2,3]
product(*l)



* private method
the method name begins with a leading understore.

Sale = collections.namedtuple('Sale', 'productid price')
sale = Sale('book', 100)
'{book} {price}'.format(**sale._asdict())

* hashable
Hashable objects are objects which have a __hash__() speical method 
whose return value is always the same throughout the object's lifetime, and 
which can be compared for equality using the __eq__() special method.


All the built-in immutable data types are hashable.
The built-in mutable data types, such as dict, list, and set are not hashable.

* list comprehension
[expression for item in iterable if condition]



* set
{}

* data create with data type
- with one argument, create a empty object.
- one same data type argument, a shallow copy
- one different data type argument, a conversion attempt
- two or more, depends

for example:
list()
list('hello')
list([1])

str()
str(1)
str('hello')

* program format
1. shebang
2. docstring
   1. brief description
   2. one black line
   3. description
   4. example
3. import
   1. built-in
   2. standard library
   3. custom
4. __all__
5. code


* path separator
#+BEGIN_SRC python
import os
path.replace("/",os.sep)
#+END_SRC

* random choice
#+BEGIN_SRC python
l = [1,2,3,4]
import random
random.choice(l)

#+END_SRC

* random sample
#+BEGIN_SRC python
import random
l = list(range(100))
print(random.sample(l,30))  # unique element 

#+END_SRC
* help
#+BEGIN_SRC python
help(iter)
#+END_SRC


* type
#+BEGIN_SRC python
a = 1
type(a)
#+END_SRC


* sort
#+BEGIN_SRC python
x = []
for i in zip(range(-10, 0, 1), range(0, 10, 2), range(1, 10, 2)):
    x += i
print(x)  # [-10, 0, 1, -9, 2, 3, -8, 4, 5, -7, 6, 7, -6, 8, 9]

y = []
for i in zip(range(-10, 0, 1), range(0, 10, 2), range(1, 10, 2)):
    y.append(i)
print(y)  # [(-10, 0, 1), (-9, 2, 3), (-8, 4, 5), (-7, 6, 7), (-6, 8, 9)]

print(sorted(x))  # [-10, -9, -8, -7, -6, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
print(sorted(x, reverse=True))  # [9, 8, 7, 6, 5, 4, 3, 2, 1, 0, -6, -7, -8, -9, -10]
print(sorted(x, key=abs))  # [0, 1, 2, 3, 4, 5, 6, -6, -7, 7, -8, 8, -9, 9, -10]
#+END_SRC

* plateform
#+BEGIN_SRC python
offset = 20 if sys.platform.startswith('win') else 10
#+END_SRC

* file number
#+BEGIN_SRC python
print('{} file{}'.format((count if count != 0 else 'no'), ('s' if count != 1 else ''))
#+END_SRC

