information-technology/programming/programming-languages/python/python-reference.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-10 Sun 01:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mike Chyson" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org30a993d">1. import</a></li>
<li><a href="#org06de857">2. list</a></li>
<li><a href="#org4d7ae00">3. string</a></li>
<li><a href="#org37cdee0">4. tuple</a></li>
<li><a href="#orgb85b0f1">5. mapping unpacking</a></li>
<li><a href="#org6cd5b6c">6. sequence unpacking</a></li>
<li><a href="#orgd18fd93">7. private method</a></li>
<li><a href="#org4e3e9db">8. hashable</a></li>
<li><a href="#org14bd598">9. list comprehension</a></li>
<li><a href="#org77697fd">10. set</a></li>
<li><a href="#org3ece8d4">11. data create with data type</a></li>
<li><a href="#org45ba430">12. program format</a></li>
<li><a href="#orgb227410">13. path separator</a></li>
<li><a href="#org86bcf73">14. random choice</a></li>
<li><a href="#org8fd9811">15. random sample</a></li>
<li><a href="#org2c8c4fd">16. help</a></li>
<li><a href="#orgc3284ae">17. type</a></li>
<li><a href="#org64b1db7">18. sort</a></li>
<li><a href="#org6d71a8b">19. plateform</a></li>
<li><a href="#org3a068a4">20. file number</a></li>
<li><a href="#org4e00d3d">21. list find</a></li>
<li><a href="#orgc12dbd3">22. if</a></li>
<li><a href="#org674b296">23. loop</a></li>
<li><a href="#orgcd81821">24. try &#x2026; catch</a></li>
<li><a href="#org88435a2">25. raise exception</a></li>
<li><a href="#orgcd0d2f7">26. function</a></li>
<li><a href="#orged46a38">27. lambda</a></li>
<li><a href="#org238e79b">28. assert</a></li>
<li><a href="#orgd530427">29. writing text to files</a></li>
<li><a href="#orgc328901">30. capture output intended to go to a file</a></li>
<li><a href="#org24b8a23">31. command line options</a></li>
<li><a href="#org3a2cec6">32. doctest</a></li>
<li><a href="#org1cdcaa8">33. unit test</a></li>
<li><a href="#orgad62d6a">34. eval</a></li>
<li><a href="#org9c5cb1b">35. special attributes</a></li>
<li><a href="#orgbe4e5ff">36. @staticmethod and @classmethod</a></li>
</ul>
</div>
</div>
<div id="outline-container-org30a993d" class="outline-2">
<h2 id="org30a993d"><span class="section-number-2">1</span> import</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">import</span> ...
<span style="color: #20b2aa; font-weight: bold;">import</span> ... <span style="color: #20b2aa; font-weight: bold;">as</span> ...
<span style="color: #20b2aa; font-weight: bold;">from</span> ... <span style="color: #20b2aa; font-weight: bold;">import</span> ...
<span style="color: #20b2aa; font-weight: bold;">from</span> ... <span style="color: #20b2aa; font-weight: bold;">import</span> *
</pre>
</div>
</div>
</div>
<div id="outline-container-org06de857" class="outline-2">
<h2 id="org06de857"><span class="section-number-2">2</span> list</h2>
<div class="outline-text-2" id="text-2">
<p>
[]<br />
</p>
</div>
</div>

<div id="outline-container-org4d7ae00" class="outline-2">
<h2 id="org4d7ae00"><span class="section-number-2">3</span> string</h2>
<div class="outline-text-2" id="text-3">
<p>
"a"<br />
'a'<br />
</p>
</div>
</div>

<div id="outline-container-org37cdee0" class="outline-2">
<h2 id="org37cdee0"><span class="section-number-2">4</span> tuple</h2>
<div class="outline-text-2" id="text-4">
<p>
'a','b'<br />
('a','b')<br />
</p>
</div>
</div>

<div id="outline-container-orgb85b0f1" class="outline-2">
<h2 id="orgb85b0f1"><span class="section-number-2">5</span> mapping unpacking</h2>
<div class="outline-text-2" id="text-5">
<p>
the mapping unpacking operator is ** and it can be applied to a mapping to produce a key-value list.<br />
**locals()<br />
</p>
</div>
</div>


<div id="outline-container-org6cd5b6c" class="outline-2">
<h2 id="org6cd5b6c"><span class="section-number-2">6</span> sequence unpacking</h2>
<div class="outline-text-2" id="text-6">
<p>
Any iterable can unpacked using the sequence unpacking operator (*)<br />
</p>

<p>
first, *rest = [1,2,3,4,5]<br />
</p>

<p>
def prouct(a, b, c):<br />
    return a * b * c<br />
</p>

<p>
l = [1,2,3]<br />
product(*l)<br />
</p>
</div>
</div>



<div id="outline-container-orgd18fd93" class="outline-2">
<h2 id="orgd18fd93"><span class="section-number-2">7</span> private method</h2>
<div class="outline-text-2" id="text-7">
<p>
the method name begins with a leading understore.<br />
</p>

<p>
Sale = collections.namedtuple('Sale', 'productid price')<br />
sale = Sale('book', 100)<br />
'{book} {price}'.format(**sale._asdict())<br />
</p>
</div>
</div>

<div id="outline-container-org4e3e9db" class="outline-2">
<h2 id="org4e3e9db"><span class="section-number-2">8</span> hashable</h2>
<div class="outline-text-2" id="text-8">
<p>
Hashable objects are objects which have a __hash__() speical method<br />
whose return value is always the same throughout the object's lifetime, and<br />
which can be compared for equality using the __eq__() special method.<br />
</p>


<p>
All the built-in immutable data types are hashable.<br />
The built-in mutable data types, such as dict, list, and set are not hashable.<br />
</p>
</div>
</div>

<div id="outline-container-org14bd598" class="outline-2">
<h2 id="org14bd598"><span class="section-number-2">9</span> list comprehension</h2>
<div class="outline-text-2" id="text-9">
<p>
[expression for item in iterable if condition]<br />
</p>
</div>
</div>



<div id="outline-container-org77697fd" class="outline-2">
<h2 id="org77697fd"><span class="section-number-2">10</span> set</h2>
<div class="outline-text-2" id="text-10">
<p>
{}<br />
</p>
</div>
</div>

<div id="outline-container-org3ece8d4" class="outline-2">
<h2 id="org3ece8d4"><span class="section-number-2">11</span> data create with data type</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>with one argument, create a empty object.<br /></li>
<li>one same data type argument, a shallow copy<br /></li>
<li>one different data type argument, a conversion attempt<br /></li>
<li>two or more, depends<br /></li>
</ul>

<p>
for example:<br />
list()<br />
list('hello')<br />
list([1])<br />
</p>

<p>
str()<br />
str(1)<br />
str('hello')<br />
</p>
</div>
</div>

<div id="outline-container-org45ba430" class="outline-2">
<h2 id="org45ba430"><span class="section-number-2">12</span> program format</h2>
<div class="outline-text-2" id="text-12">
<ol class="org-ol">
<li>shebang<br /></li>
<li>docstring<br />
<ol class="org-ol">
<li>brief description<br /></li>
<li>one black line<br /></li>
<li>description<br /></li>
<li>example<br /></li>
</ol></li>
<li>import<br />
<ol class="org-ol">
<li>built-in<br /></li>
<li>standard library<br /></li>
<li>custom<br /></li>
</ol></li>
<li>__all__<br /></li>
<li>code<br /></li>
</ol>
</div>
</div>


<div id="outline-container-orgb227410" class="outline-2">
<h2 id="orgb227410"><span class="section-number-2">13</span> path separator</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">import</span> os
path.replace(<span style="color: #ffa07a;">"/"</span>,os.sep)
</pre>
</div>
</div>
</div>

<div id="outline-container-org86bcf73" class="outline-2">
<h2 id="org86bcf73"><span class="section-number-2">14</span> random choice</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9acd32;">l</span> = [1,2,3,4]
<span style="color: #20b2aa; font-weight: bold;">import</span> random
random.choice(l)

</pre>
</div>
</div>
</div>

<div id="outline-container-org8fd9811" class="outline-2">
<h2 id="org8fd9811"><span class="section-number-2">15</span> random sample</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">import</span> random
<span style="color: #9acd32;">l</span> = <span style="color: #76ee00;">list</span>(<span style="color: #76ee00;">range</span>(100))
<span style="color: #20b2aa; font-weight: bold;">print</span>(random.sample(l,30))  <span style="color: #cd853f;"># </span><span style="color: #cd853f;">unique element </span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org2c8c4fd" class="outline-2">
<h2 id="org2c8c4fd"><span class="section-number-2">16</span> help</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #76ee00;">help</span>(<span style="color: #76ee00;">iter</span>)
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc3284ae" class="outline-2">
<h2 id="orgc3284ae"><span class="section-number-2">17</span> type</h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9acd32;">a</span> = 1
<span style="color: #76ee00;">type</span>(a)
</pre>
</div>
</div>
</div>


<div id="outline-container-org64b1db7" class="outline-2">
<h2 id="org64b1db7"><span class="section-number-2">18</span> sort</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9acd32;">x</span> = []
<span style="color: #20b2aa; font-weight: bold;">for</span> i <span style="color: #20b2aa; font-weight: bold;">in</span> <span style="color: #76ee00;">zip</span>(<span style="color: #76ee00;">range</span>(-10, 0, 1), <span style="color: #76ee00;">range</span>(0, 10, 2), <span style="color: #76ee00;">range</span>(1, 10, 2)):
    <span style="color: #9acd32;">x</span> += i
<span style="color: #20b2aa; font-weight: bold;">print</span>(x)  <span style="color: #cd853f;"># </span><span style="color: #cd853f;">[-10, 0, 1, -9, 2, 3, -8, 4, 5, -7, 6, 7, -6, 8, 9]</span>

<span style="color: #9acd32;">y</span> = []
<span style="color: #20b2aa; font-weight: bold;">for</span> i <span style="color: #20b2aa; font-weight: bold;">in</span> <span style="color: #76ee00;">zip</span>(<span style="color: #76ee00;">range</span>(-10, 0, 1), <span style="color: #76ee00;">range</span>(0, 10, 2), <span style="color: #76ee00;">range</span>(1, 10, 2)):
    y.append(i)
<span style="color: #20b2aa; font-weight: bold;">print</span>(y)  <span style="color: #cd853f;"># </span><span style="color: #cd853f;">[(-10, 0, 1), (-9, 2, 3), (-8, 4, 5), (-7, 6, 7), (-6, 8, 9)]</span>

<span style="color: #20b2aa; font-weight: bold;">print</span>(<span style="color: #76ee00;">sorted</span>(x))  <span style="color: #cd853f;"># </span><span style="color: #cd853f;">[-10, -9, -8, -7, -6, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9]</span>
<span style="color: #20b2aa; font-weight: bold;">print</span>(<span style="color: #76ee00;">sorted</span>(x, reverse=<span style="color: #1e90ff;">True</span>))  <span style="color: #cd853f;"># </span><span style="color: #cd853f;">[9, 8, 7, 6, 5, 4, 3, 2, 1, 0, -6, -7, -8, -9, -10]</span>
<span style="color: #20b2aa; font-weight: bold;">print</span>(<span style="color: #76ee00;">sorted</span>(x, key=<span style="color: #76ee00;">abs</span>))  <span style="color: #cd853f;"># </span><span style="color: #cd853f;">[0, 1, 2, 3, 4, 5, 6, -6, -7, 7, -8, 8, -9, 9, -10]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6d71a8b" class="outline-2">
<h2 id="org6d71a8b"><span class="section-number-2">19</span> plateform</h2>
<div class="outline-text-2" id="text-19">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9acd32;">offset</span> = 20 <span style="color: #20b2aa; font-weight: bold;">if</span> sys.platform.startswith(<span style="color: #ffa07a;">'win'</span>) <span style="color: #20b2aa; font-weight: bold;">else</span> 10
</pre>
</div>
</div>
</div>

<div id="outline-container-org3a068a4" class="outline-2">
<h2 id="org3a068a4"><span class="section-number-2">20</span> file number</h2>
<div class="outline-text-2" id="text-20">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">print</span>(<span style="color: #ffa07a;">'{} file{}'</span>.<span style="color: #76ee00;">format</span>((count <span style="color: #20b2aa; font-weight: bold;">if</span> count != 0 <span style="color: #20b2aa; font-weight: bold;">else</span> <span style="color: #ffa07a;">'no'</span>), (<span style="color: #ffa07a;">'s'</span> <span style="color: #20b2aa; font-weight: bold;">if</span> count != 1 <span style="color: #20b2aa; font-weight: bold;">else</span> <span style="color: #ffa07a;">''</span>))
</pre>
</div>
</div>
</div>
