information-technology/programming/programming-languages/python/python-reference.org
* list find
like list find method.

while version:
#+BEGIN_SRC python
def list_find(lst, target):
    index = 0
    while index < len(lst):
        if lst[index] == target:
            break
        index += 1
    else:
        index = -1
    return index
#+END_SRC

loop version:
#+BEGIN_SRC python
def list_find(lst,target):
    for index, x in enumerate(lst):
        if x == target:
            break
    else:
        index = -1
    return index
#+END_SRC 

exception version:
#+BEGIN_SRC python
def list_find(lst,target):
    try:
        index = lst.index(target)
    except ValueError:
        index = -1
    return index
#+END_SRC

* if
conditional branch statement:
#+BEGIN_SRC python
if boolean_expression1:
    suite1
elif boolean_expression2:
    suite2
...
elif boolean_expressionN:
    suiteN
else:
    else_suite
#+END_SRC
There can be zero or more elif clauses, and the final else clause is optional.

conditional expression:
#+BEGIN_SRC python
expression1 if boolean_expression else expression2
#+END_SRC

* loop
#+BEGIN_SRC python
while boolean_expression:
    while_suite
else:
    else_suite
#+END_SRC

#+BEGIN_SRC python
for expression in iterable:
    for_suite
else:
    else_suite
#+END_SRC

* try ... catch
#+BEGIN_SRC python
try:
    try_suite
except exception_group1 as variable1:
    except_suite1
...
except exception_groupN as variableN:
    except_suiteN
else:
    else_suite
finally:
    finally_suite
#+END_SRC

* raise exception
#+BEGIN_SRC python
raise exception(args)
raise exception(args) from original_exception
raise
#+END_SRC

* function
#+BEGIN_SRC python
def functionName(parameters):
    suite
#+END_SRC


* lambda
#+BEGIN_SRC python
lambda parameters: expression
#+END_SRC

* assert
#+BEGIN_SRC python
assert boolean_expression, optional_expression
#+END_SRC


* writing text to files
Python provides tow different ways of writing text to files.
1. use a file object's write() method
2. use the print() function
#+BEGIN_SRC python
import sys
sys.stdout.write("message\n")
print("message", file=sys.stdout)
#+END_SRC

#+BEGIN_SRC python
# to restore back to stdout
sys.stdout = sys.__stdout__
#+END_SRC
* capture output intended to go to a file
#+BEGIN_SRC python
import io
import sys

sys.stdout = io.StringIO()
print('hello')
print('world')
content = sys.stdout.getvalue()
sys.stdout = sys.__stdout__
print(content)
#+END_SRC

* command line options
#+BEGIN_SRC python
parser = optparse.OptionParser()
parser.set_usage("%prog inputfile outputfile [options]")
parser.add_option("-m", "--mode", dest="mode",
                  help="available values: encrypt|enc|decrypt|dec [default: %default]")
parser.add_option('-k', '--key', dest='key',
                  help='the key for encryption and decryption [default: %default')
parser.set_defaults(mode="enc", key='123456')
opts, args = parser.parse_args()

inputfile = args[0]
outputfile = args[1]
mode = opts.mode
key = opts.key
#+END_SRC

"%default" rext replaced with the option's default value;
the options are available using the "dest" names.

If an error occurs when parsing the command line, the optparse parser will call sys.exit(2).
* doctest
#+BEGIN_SRC python
if __name__ == "__main__":
    import doctest
    doctest.testmod() # test module
#+END_SRC
* unit test
#+BEGIN_SRC python
import unittest
#+END_SRC
