information-technology/programming/programming-languages/python/python-reference.html

<div id="outline-container-org4e00d3d" class="outline-2">
<h2 id="org4e00d3d"><span class="section-number-2">21</span> list find</h2>
<div class="outline-text-2" id="text-21">
<p>
like list find method.<br />
</p>

<p>
while version:<br />
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">def</span> <span style="color: #00ff7f;">list_find</span>(lst, target):
    <span style="color: #9acd32;">index</span> = 0
    <span style="color: #20b2aa; font-weight: bold;">while</span> index &lt; <span style="color: #76ee00;">len</span>(lst):
        <span style="color: #20b2aa; font-weight: bold;">if</span> lst[index] == target:
            <span style="color: #20b2aa; font-weight: bold;">break</span>
        <span style="color: #9acd32;">index</span> += 1
    <span style="color: #20b2aa; font-weight: bold;">else</span>:
        <span style="color: #9acd32;">index</span> = -1
    <span style="color: #20b2aa; font-weight: bold;">return</span> index
</pre>
</div>

<p>
loop version:<br />
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">def</span> <span style="color: #00ff7f;">list_find</span>(lst,target):
    <span style="color: #20b2aa; font-weight: bold;">for</span> index, x <span style="color: #20b2aa; font-weight: bold;">in</span> <span style="color: #76ee00;">enumerate</span>(lst):
        <span style="color: #20b2aa; font-weight: bold;">if</span> x == target:
            <span style="color: #20b2aa; font-weight: bold;">break</span>
    <span style="color: #20b2aa; font-weight: bold;">else</span>:
        <span style="color: #9acd32;">index</span> = -1
    <span style="color: #20b2aa; font-weight: bold;">return</span> index
</pre>
</div>

<p>
exception version:<br />
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">def</span> <span style="color: #00ff7f;">list_find</span>(lst,target):
    <span style="color: #20b2aa; font-weight: bold;">try</span>:
        <span style="color: #9acd32;">index</span> = lst.index(target)
    <span style="color: #20b2aa; font-weight: bold;">except</span> <span style="color: #9370db;">ValueError</span>:
        <span style="color: #9acd32;">index</span> = -1
    <span style="color: #20b2aa; font-weight: bold;">return</span> index
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc12dbd3" class="outline-2">
<h2 id="orgc12dbd3"><span class="section-number-2">22</span> if</h2>
<div class="outline-text-2" id="text-22">
<p>
conditional branch statement:<br />
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">if</span> boolean_expression1:
    suite1
<span style="color: #20b2aa; font-weight: bold;">elif</span> boolean_expression2:
    suite2
...
<span style="color: #20b2aa; font-weight: bold;">elif</span> boolean_expressionN:
    suiteN
<span style="color: #20b2aa; font-weight: bold;">else</span>:
    else_suite
</pre>
</div>
<p>
There can be zero or more elif clauses, and the final else clause is optional.<br />
</p>

<p>
conditional expression:<br />
</p>
<div class="org-src-container">
<pre class="src src-python">expression1 <span style="color: #20b2aa; font-weight: bold;">if</span> boolean_expression <span style="color: #20b2aa; font-weight: bold;">else</span> expression2
</pre>
</div>
</div>
</div>

<div id="outline-container-org674b296" class="outline-2">
<h2 id="org674b296"><span class="section-number-2">23</span> loop</h2>
<div class="outline-text-2" id="text-23">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">while</span> boolean_expression:
    while_suite
<span style="color: #20b2aa; font-weight: bold;">else</span>:
    else_suite
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">for</span> expression <span style="color: #20b2aa; font-weight: bold;">in</span> iterable:
    for_suite
<span style="color: #20b2aa; font-weight: bold;">else</span>:
    else_suite
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd81821" class="outline-2">
<h2 id="orgcd81821"><span class="section-number-2">24</span> try &#x2026; catch</h2>
<div class="outline-text-2" id="text-24">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">try</span>:
    try_suite
<span style="color: #20b2aa; font-weight: bold;">except</span> exception_group1 <span style="color: #20b2aa; font-weight: bold;">as</span> variable1:
    except_suite1
...
<span style="color: #20b2aa; font-weight: bold;">except</span> exception_groupN <span style="color: #20b2aa; font-weight: bold;">as</span> variableN:
    except_suiteN
<span style="color: #20b2aa; font-weight: bold;">else</span>:
    else_suite
<span style="color: #20b2aa; font-weight: bold;">finally</span>:
    finally_suite
</pre>
</div>
</div>
</div>

<div id="outline-container-org88435a2" class="outline-2">
<h2 id="org88435a2"><span class="section-number-2">25</span> raise exception</h2>
<div class="outline-text-2" id="text-25">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">raise</span> exception(args)
<span style="color: #20b2aa; font-weight: bold;">raise</span> exception(args) <span style="color: #20b2aa; font-weight: bold;">from</span> original_exception
<span style="color: #20b2aa; font-weight: bold;">raise</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd0d2f7" class="outline-2">
<h2 id="orgcd0d2f7"><span class="section-number-2">26</span> function</h2>
<div class="outline-text-2" id="text-26">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">def</span> <span style="color: #00ff7f;">functionName</span>(parameters):
    suite
</pre>
</div>
</div>
</div>


<div id="outline-container-orged46a38" class="outline-2">
<h2 id="orged46a38"><span class="section-number-2">27</span> lambda</h2>
<div class="outline-text-2" id="text-27">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">lambda</span> parameters: expression
</pre>
</div>
</div>
</div>

<div id="outline-container-org238e79b" class="outline-2">
<h2 id="org238e79b"><span class="section-number-2">28</span> assert</h2>
<div class="outline-text-2" id="text-28">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">assert</span> boolean_expression, optional_expression
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd530427" class="outline-2">
<h2 id="orgd530427"><span class="section-number-2">29</span> writing text to files</h2>
<div class="outline-text-2" id="text-29">
<p>
Python provides tow different ways of writing text to files.<br />
</p>
<ol class="org-ol">
<li>use a file object's write() method<br /></li>
<li>use the print() function<br /></li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">import</span> sys
sys.stdout.write(<span style="color: #ffa07a;">"message\n"</span>)
<span style="color: #20b2aa; font-weight: bold;">print</span>(<span style="color: #ffa07a;">"message"</span>, <span style="color: #76ee00;">file</span>=sys.stdout)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #cd853f;"># </span><span style="color: #cd853f;">to restore back to stdout</span>
<span style="color: #9acd32;">sys.stdout</span> = sys.__stdout__
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc328901" class="outline-2">
<h2 id="orgc328901"><span class="section-number-2">30</span> capture output intended to go to a file</h2>
<div class="outline-text-2" id="text-30">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">import</span> io
<span style="color: #20b2aa; font-weight: bold;">import</span> sys

<span style="color: #9acd32;">sys.stdout</span> = io.StringIO()
<span style="color: #20b2aa; font-weight: bold;">print</span>(<span style="color: #ffa07a;">'hello'</span>)
<span style="color: #20b2aa; font-weight: bold;">print</span>(<span style="color: #ffa07a;">'world'</span>)
<span style="color: #9acd32;">content</span> = sys.stdout.getvalue()
<span style="color: #9acd32;">sys.stdout</span> = sys.__stdout__
<span style="color: #20b2aa; font-weight: bold;">print</span>(content)
</pre>
</div>
</div>
</div>

<div id="outline-container-org24b8a23" class="outline-2">
<h2 id="org24b8a23"><span class="section-number-2">31</span> command line options</h2>
<div class="outline-text-2" id="text-31">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #9acd32;">parser</span> = optparse.OptionParser()
parser.set_usage(<span style="color: #ffa07a;">"%prog inputfile outputfile [options]"</span>)
parser.add_option(<span style="color: #ffa07a;">"-m"</span>, <span style="color: #ffa07a;">"--mode"</span>, dest=<span style="color: #ffa07a;">"mode"</span>,
                  <span style="color: #76ee00;">help</span>=<span style="color: #ffa07a;">"available values: encrypt|enc|decrypt|dec [default: %default]"</span>)
parser.add_option(<span style="color: #ffa07a;">'-k'</span>, <span style="color: #ffa07a;">'--key'</span>, dest=<span style="color: #ffa07a;">'key'</span>,
                  <span style="color: #76ee00;">help</span>=<span style="color: #ffa07a;">'the key for encryption and decryption [default: %default'</span>)
parser.set_defaults(mode=<span style="color: #ffa07a;">"enc"</span>, key=<span style="color: #ffa07a;">'123456'</span>)
<span style="color: #9acd32;">opts</span>, <span style="color: #9acd32;">args</span> = parser.parse_args()

<span style="color: #9acd32;">inputfile</span> = args[0]
<span style="color: #9acd32;">outputfile</span> = args[1]
<span style="color: #9acd32;">mode</span> = opts.mode
<span style="color: #9acd32;">key</span> = opts.key
</pre>
</div>

<p>
"%default" rext replaced with the option's default value;<br />
the options are available using the "dest" names.<br />
</p>

<p>
If an error occurs when parsing the command line, the optparse parser will call sys.exit(2).<br />
</p>
</div>
</div>
<div id="outline-container-org3a2cec6" class="outline-2">
<h2 id="org3a2cec6"><span class="section-number-2">32</span> doctest</h2>
<div class="outline-text-2" id="text-32">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">if</span> <span style="color: #76ee00;">__name__</span> == <span style="color: #ffa07a;">"__main__"</span>:
    <span style="color: #20b2aa; font-weight: bold;">import</span> doctest
    doctest.testmod() <span style="color: #cd853f;"># </span><span style="color: #cd853f;">test module</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1cdcaa8" class="outline-2">
<h2 id="org1cdcaa8"><span class="section-number-2">33</span> unit test</h2>
<div class="outline-text-2" id="text-33">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">import</span> unittest
</pre>
</div>
</div>
</div>
