information-technology/programming/programming-languages/python/python-reference.org
* eval
#+BEGIN_SRC python
import Shape


p = Shape.Point(3, 9)
print(repr(p))  # Point(3, 9)

# We must give the module name when eval()ing if we used import Shape.
# if from Shape import Point is used, it is used necessary
q = eval(p.__module__ + "." + repr(p))
print(repr(q))  # Point(3, 9)

#+END_SRC

* special attributes
| __name__   |   |
| __module__ |   |
| __class__  |   |

| @property     |   |
| @staticmethod |   |
| @classmethod  |   |

| __lt__(self, other) | <  |
| __le__(self, other) | <= |
| __eq__(self, other) | == |
| __ne__(self, other) | != |
| __ge__(self, other) | >= |
| __gt__(self, other) | >  |


| __bool__(self)               |
| __format__(self,format_spec) |
| __hash__(self)               |
| __init__(self,args)          |
| __new__(cls,args)            |
| __repr__(self)               |
| __str__(self)                |


| __abs__(self)  |
| __pos__(self)  |
| __add__(self)  |
| __iadd__(self) |
| __radd__(self) |
| __xor__(self)  |
| __ixor__(self) |
| __rxor__(self) |

* @staticmethod and @classmethod
@classmethod must have a reference to a class object as the first parameter, whereas @staticmethod can have no parameters at all.
#+BEGIN_SRC python
# The first parameter is the object instance reference.
def instancemethod_(self, ...)
    suit


# The first parameter is the class reference.
@classmethod
def classmethod_(cls, ...)
    suit


# There is no reference to the instance or class.
@staticmethod(...)
    suit
#+END_SRC
