information-technology/programming/programming-languages/python/python-reference.html
<div id="outline-container-orgad62d6a" class="outline-2">
<h2 id="orgad62d6a"><span class="section-number-2">34</span> eval</h2>
<div class="outline-text-2" id="text-34">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #20b2aa; font-weight: bold;">import</span> Shape


<span style="color: #9acd32;">p</span> = Shape.Point(3, 9)
<span style="color: #20b2aa; font-weight: bold;">print</span>(<span style="color: #76ee00;">repr</span>(p))  <span style="color: #cd853f;"># </span><span style="color: #cd853f;">Point(3, 9)</span>

<span style="color: #cd853f;"># </span><span style="color: #cd853f;">We must give the module name when eval()ing if we used import Shape.</span>
<span style="color: #cd853f;"># </span><span style="color: #cd853f;">if from Shape import Point is used, it is used necessary</span>
<span style="color: #9acd32;">q</span> = <span style="color: #76ee00;">eval</span>(p.__module__ + <span style="color: #ffa07a;">"."</span> + <span style="color: #76ee00;">repr</span>(p))
<span style="color: #20b2aa; font-weight: bold;">print</span>(<span style="color: #76ee00;">repr</span>(q))  <span style="color: #cd853f;"># </span><span style="color: #cd853f;">Point(3, 9)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org9c5cb1b" class="outline-2">
<h2 id="org9c5cb1b"><span class="section-number-2">35</span> special attributes</h2>
<div class="outline-text-2" id="text-35">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">__name__</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">__module__</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">__class__</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">@property</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">@staticmethod</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">@classmethod</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">__lt__(self, other)</td>
<td class="org-left">&lt;</td>
</tr>

<tr>
<td class="org-left">__le__(self, other)</td>
<td class="org-left">&lt;=</td>
</tr>

<tr>
<td class="org-left">__eq__(self, other)</td>
<td class="org-left">==</td>
</tr>

<tr>
<td class="org-left">__ne__(self, other)</td>
<td class="org-left">!=</td>
</tr>

<tr>
<td class="org-left">__ge__(self, other)</td>
<td class="org-left">&gt;=</td>
</tr>

<tr>
<td class="org-left">__gt__(self, other)</td>
<td class="org-left">&gt;</td>
</tr>
</tbody>
</table>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">__bool__(self)</td>
</tr>

<tr>
<td class="org-left">__format__(self,format_spec)</td>
</tr>

<tr>
<td class="org-left">__hash__(self)</td>
</tr>

<tr>
<td class="org-left">__init__(self,args)</td>
</tr>

<tr>
<td class="org-left">__new__(cls,args)</td>
</tr>

<tr>
<td class="org-left">__repr__(self)</td>
</tr>

<tr>
<td class="org-left">__str__(self)</td>
</tr>
</tbody>
</table>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">__abs__(self)</td>
</tr>

<tr>
<td class="org-left">__pos__(self)</td>
</tr>

<tr>
<td class="org-left">__add__(self)</td>
</tr>

<tr>
<td class="org-left">__iadd__(self)</td>
</tr>

<tr>
<td class="org-left">__radd__(self)</td>
</tr>

<tr>
<td class="org-left">__xor__(self)</td>
</tr>

<tr>
<td class="org-left">__ixor__(self)</td>
</tr>

<tr>
<td class="org-left">__rxor__(self)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgbe4e5ff" class="outline-2">
<h2 id="orgbe4e5ff"><span class="section-number-2">36</span> @staticmethod and @classmethod</h2>
<div class="outline-text-2" id="text-36">
<p>
@classmethod must have a reference to a class object as the first parameter, whereas @staticmethod can have no parameters at all.<br />
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #cd853f;"># </span><span style="color: #cd853f;">The first parameter is the object instance reference.</span>
<span style="color: #20b2aa; font-weight: bold;">def</span> <span style="color: #00ff7f;">instancemethod_</span>(<span style="color: #20b2aa; font-weight: bold;">self</span>, ...)
    suit


<span style="color: #cd853f;"># </span><span style="color: #cd853f;">The first parameter is the class reference.</span>
<span style="color: #9370db;">@classmethod</span>
<span style="color: #20b2aa; font-weight: bold;">def</span> <span style="color: #00ff7f;">classmethod_</span>(cls, ...)
    suit


<span style="color: #cd853f;"># </span><span style="color: #cd853f;">There is no reference to the instance or class.</span>
<span style="color: #9370db;">@staticmethod</span>(...)
    suit
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mike Chyson</p>
<p class="date">Created: 2020-05-10 Sun 01:08</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
